/*****************************************************************************
MQ2AutoLogin.cpp

Copyright (C) 2012 ieatacid

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License, version 2, as
published by the Free Software Foundation.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

Change log:
# Version: 2.6 - Derple 08-21-2016 - Added a new flag which disables autologin after the first successful login.  It can re-enabled by pressing HOME.
# Version: 2.5 - Eqmule 07-29-2016 - Moved processing into its own detour, removed waitforinputidle and all arbitrary Sleeps.
# Version: 2.4 - Eqmule 07-22-2016 - Added support for emulators
# Version: 2.3 - Eqmule 07-22-2016 - Added string safety.
# Version: 2.2 by eqmule/derple 20160629
- made all WaitForInputIdle 60 seconds to prevent crashes
- Added an extra crash check.

# Version: 2.1 by eqmule 20160627
- Added Encryption to the plugin and support for MacroQuest2.exe profiles.

# Version: 2.0 by eqmule 20160616
- Added Version Support
- Updated to not crash on /unload
- Added a feature to login your char if you inject/reinject at char select
- this setting is called LoginOnReLoadAtCharSelect=1 and should go under Settings if you want to use it.

#  20150711 - eqmule
- Updated for lockjaw server 

#  20150523 - eqmule
- Updated for ragefire server and some other bugfixes and stuff...

#  20150428 - eqmule
- Updated for latest patch

#  20131009 - ieatacid
- Added 'test' to server list, per request

#  20131004 - eqmule
- Updated for latest patch
- Had to change the MAX_WINDOWS or we would get caught in a loop...

Change log:
#  20121111
- Updated for latest patch

#  20121101
- Added vox and trakanon servers

#  20121020
- Added ability to check for active characters and login offline character
- Removed instant camp stuff

#  20120901
- Doubled Sleep durations to stop crashes

#  2011121
- Updated for VoA expansion release

#  20110215
- Added new server names (thanks, htw)

#  20101024
- Fixed offset patterns that were broken with House of Thule expansion release

#  20100622
- Adjusted for server merges

#  20091125
- Fixed issue with a blank character name making the login process stop at character select

#  20091121
- Now supports using station names rather than sessions (this is helpful if you use WinEQ2 profiles)

#  20091118
- The plugin now clicks through the order expansion screen

#  20091117
- The plugin will now click through the seizure warning screen

#  20091112
- Fixed for November 11th patch

#  20090908
- Made some adjustments that speed up logging in
- Debug logging now adds a time stamp

# 20090906a
- Fixed a bug where two threads were being created at start-up
- The session count is retrieved using the process list rather than enumerating through windows
- If debugging is enabled, the output now goes to a text file at "c:/MQ2AutoLogin_dbg.txt". The file path can be changed at the top of the .cpp file
- If server name isn't specified in the ini file it will stop at the server-select screen
- If a character name isn't specified in the ini file it will stop at the character-select screen

# 20090906
- Added ini option for setting a different ini file path, e.g. (in Settings) "IniLocation=x:\mq2"
- Integrated MQ2SwitchChar

# 20090831
- Initial release
******************************************************************************/


#include "../MQ2Plugin.h"
PLUGIN_VERSION(2.6);
#include <map>
#include <tlhelp32.h>
PreSetup("MQ2AutoLogin");
#include <wincrypt.h>
#pragma comment( lib, "Crypt32.lib" )

#define MAX_WINDOWS 150 // had to lower this for CotF patch it never reaches 200...

/*** un-comment to enable debug logging ***/
//#define AUTOLOGIN_DBG

/*** this can be changed ***/
#define DBG_LOGFILE_PATH "c:\\MQ2AutoLogin_dbg.txt"


#ifdef AUTOLOGIN_DBG
#define AutoLoginDebug DebugLog
#else
#define AutoLoginDebug //
#endif
ULONGLONG ullerrorwait = 0;

struct _ServerData {
    char *Name;
    DWORD ID;
};


_ServerData ServerData[] = {
    {"lockjaw",    160},
    {"ragefire",   159},
    {"vox",        158},
    {"trakanon",   154},
    {"fippy",      156},
    {"vulak",      157},
    {"mayong",     163},
    {"antonius",    68},
    {"bertox",      53},
    {"bristle",      9},
    {"cazic",       49},
    {"drinal",      40},
    {"erollisi",    48},
    {"firiona",     77},
    {"luclin",      76},
    {"povar",        5},
    {"rathe",       46},
    {"tunare",      57},
    {"xegony",      51},
    {"zek",         54},
    {"test",         1},
    {0, 0},
};
typedef struct _SERVERINFO
{
/*0x00*/	DWORD ID;
/*0x04*/	PCXSTR ServerName;
/*0x08*/	PCXSTR ServerIP;
/*0x0C*/	DWORD Unknown0x0C;
/*0x10*/	DWORD Unknown0x10;
/*0x14*/	DWORD Unknown0x14;
/*0x018*/	DWORD Unknown0x018;
/*0x01C*/	DWORD Unknown0x01C;
/*0x020*/	DWORD Unknown0x020;
/*0x024*/	DWORD Unknown0x024;
/*0x028*/	DWORD Unknown0x028;
/*0x02C*/	DWORD Unknown0x02C;
/*0x030*/	DWORD Unknown0x030;
/*0x034*/	DWORD Unknown0x034;
/*0x038*/	DWORD Unknown0x038;
/*0x03C*/	DWORD Unknown0x03C;
/*0x040*/	DWORD Unknown0x040;
/*0x044*/	DWORD Players;//only on emu, its not sent for live servers.
/*0x048*/	DWORD Unknown0x048;
/*0x04C*/	DWORD Unknown0x04C;
/*0x050*/
}SERVERINFO,*PSERVERINFO;
typedef struct _SERVERLIST
{
/*0x00*/	PSERVERINFO Info;
/*0x04*/	_SERVERLIST *Prev;
/*0x08*/	_SERVERLIST *Next;
/*0x0C*/	DWORD Unknown0x0C;
/*0x10*/	DWORD Unknown0x10;
/*0x14*/	DWORD Unknown0x14;
/*0x18*/
}SERVERLIST,*PSERVERLIST;

typedef struct _PSERVERSTUFF
{
/*0x000*/	BYTE Unknown0x000[0x8];
/*0x008*/	PVOID GFXENGINE;
/*0x00C*/	BYTE Unknown0x00C[0x9C];
/*0x0A8*/	DWORD CurrentServerID;
/*0x0AC*/	DWORD Unknown0x0AC;
/*0x0B0*/	PCXSTR LoginName;
/*0x0B4*/	PCXSTR Password;
/*0x0B8*/	PCXSTR LoginNameCopy;
/*0x0BC*/	PCXSTR PasswordCopy;
/*0x0C0*/	PCXSTR AccountKey;
/*0x0C4*/	BYTE Unknown0x0C4[0x14];
/*0x0D8*/	PSERVERINFO *FirstServer;//D8
/*0x0DC*/	PSERVERINFO *LastServer;//DC
/*0x0E0*/	BYTE Unknown0x0E0[0x8];
/*0x0E8*/	PSERVERLIST pServerList;
/*0x0EC*/	DWORD ServerListSize;
/*0x0F0*/	BYTE Unknown0x0F0[0x8];
/*0x0F8*/	DWORD QuickConnectServerID;
/*0x0FC*/	PCXSTR QuickConnectServerName;
/*0x100*/	PCXSTR QuickConnectIPAddress;//0x100
/*0x104*/
} SERVERSTUFF, *PSERVERSTUFF;
DWORD dwServerInfo = 0;
CSidlManager *pSidlManager = 0;
PCXWNDMGR pWindowManager = 0;
class CLoginViewManager *pLoginViewManager = 0;
DWORD dwEQMainBase = 0;
DWORD dwGetXMLDataAddr = 0;
DWORD dwSendLMouseClickAddr = 0;
DWORD dwEnterGameAddr = 0;
DWORD dwLoginClient = 0;
DWORD dwServerID = 0;
UINT bKickActiveChar = 1;
UINT bUseMQ2Login = false;
UINT bUseStationNamesInsteadOfSessions = false;
UINT bReLoggin = false;
bool bEndAfterCharSelect = false;
bool bLogin = true;
bool bEnd = false;
bool bInGame = false;
bool bSwitchServer = false;
bool bSwitchChar = false;
bool bSwitchTime = false;
char szStationName[64] = {0};
char szCustomIni[64] = { 0 };
char szPassword[64] = {0};
char szServerName[32] = {0};
char szCharacterName[64] = {0};
char szNewChar[0x40] = {0};
ULONGLONG dwTime = 0;
ULONGLONG switchTime = 0;
map<string, class CXWnd2 *> WindowMap;


