/*****************************************************************************
MQ2AutoLogin.cpp

Copyright (C) 2012 ieatacid

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License, version 2, as
published by the Free Software Foundation.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

Change log:
# Version: 2.9 - EqMule 05-28-2029 - Added more support for confirmation dialogs
# Version: 2.8 - SwiftyMUSE 03-11-2018 - Added global hotkey processing
# Version: 2.7 - EqMule 10-04-2016 - Added a new flag to make sure we have tried to get credentials. and some other stuff
# Version: 2.6 - Derple 08-21-2016 - Added a new flag which disables autologin after the first successful login.  It can re-enabled by pressing HOME.
# Version: 2.5 - Eqmule 07-29-2016 - Moved processing into its own detour, removed waitforinputidle and all arbitrary Sleeps.
# Version: 2.4 - Eqmule 07-22-2016 - Added support for emulators
# Version: 2.3 - Eqmule 07-22-2016 - Added string safety.
# Version: 2.2 by eqmule/derple 20160629
- made all WaitForInputIdle 60 seconds to prevent crashes
- Added an extra crash check.

# Version: 2.1 by eqmule 20160627
- Added Encryption to the plugin and support for MacroQuest2.exe profiles.


- Added a feature to login your char if you load/reload at char select
- this setting is called LoginOnReLoadAtCharSelect=1 and should go under Settings if you want to use it.

#  20150711 - eqmule
- Updated for lockjaw server 

#  20150523 - eqmule
- Updated for ragefire server and some other bugfixes and stuff...

#  20150428 - eqmule
- Updated for latest patch

#  20131009 - ieatacid
- Added 'test' to server list, per request

#  20131004 - eqmule
- Updated for latest patch
- Had to change the MAX_WINDOWS or we would get caught in a loop...

Change log:
#  20121111
- Updated for latest patch

#  20121101
- Added vox and trakanon servers

#  20121020
- Added ability to check for active characters and login offline character
- Removed instant camp stuff

#  20120901
- Doubled Sleep durations to stop crashes

#  2011121
- Updated for VoA expansion release

#  20110215
- Added new server names (thanks, htw)

#  20101024
- Fixed offset patterns that were broken with House of Thule expansion release

#  20100622
- Adjusted for server merges

#  20091125
- Fixed issue with a blank character name making the login process stop at character select

#  20091121
- Now supports using station names rather than sessions (this is helpful if you use WinEQ2 profiles)

#  20091118
- The plugin now clicks through the order expansion screen

#  20091117
- The plugin will now click through the seizure warning screen

#  20091112
- Fixed for November 11th patch

#  20090908
- Made some adjustments that speed up logging in
- Debug logging now adds a time stamp

# 20090906a
- Fixed a bug where two threads were being created at start-up
- The session count is retrieved using the process list rather than enumerating through windows
- If debugging is enabled, the output now goes to a text file at "c:/MQ2AutoLogin_dbg.txt". The file path can be changed at the top of the .cpp file
- If server name isn't specified in the ini file it will stop at the server-select screen
- If a character name isn't specified in the ini file it will stop at the character-select screen

# 20090906
- Added ini option for setting a different ini file path, e.g. (in Settings) "IniLocation=x:\mq2"
- Integrated MQ2SwitchChar

# 20090831
- Initial release
******************************************************************************/


#include "../MQ2Plugin.h"
#define   PLUGIN_NAME  "MQ2AutoLogin"
#define   PLUGIN_DATE  20181212
PLUGIN_VERSION(2.9);

#include <map>
#include <tlhelp32.h>
PreSetup("MQ2AutoLogin");
#include <wincrypt.h>
#pragma comment( lib, "Crypt32.lib" )
using namespace std;
bool bWeAreDown = false;
int bNotifyOnServerUP = 0;
#define MAX_WINDOWS 150 // had to lower this for CotF patch it never reaches 200...

/*** un-comment to enable debug logging ***/
//#define AUTOLOGIN_DBG

/*** this can be changed ***/
#define DBG_LOGFILE_PATH "c:\\MQ2AutoLogin_dbg.txt"

bool bLoginCheckDone = false;
#ifdef AUTOLOGIN_DBG
#define AutoLoginDebug DebugLog
#else
#define AutoLoginDebug //
#endif
ULONGLONG ullerrorwait = 0;

struct _ServerData {
    PCHAR Name;
    DWORD ID;
};

_ServerData ServerData[] = {
    {"rizlona",    169},
    {"lockjaw",    160},
    {"ragefire",   159},
    {"vox",        158},
    {"trakanon",   155},
    {"fippy",      156},
    {"vulak",      157},
    {"mayong",     163},
    {"antonius",   100},
    {"beta",        2},
    {"brekt",       162},
    {"bertox",      102},
    {"bristle",     104},
    {"cazic",       105},
    {"drinal",      106},
    {"erollisi",    109},
    {"firiona",     111},
    {"luclin",      116},
    {"povar",       123},
    {"rathe",       127},
    {"tunare",      140},
    {"xegony",      144},
    {"zek",         147},
    {"test",         1},
    {0, 0},
};
/*_ServerData ServerData[] = {
    {"lockjaw",    160},
    {"ragefire",   159},
    {"vox",        158},
    {"trakanon",   154},
    {"fippy",      156},
    {"vulak",      157},
    {"mayong",     163},
    {"antonius",    68},
    {"beta",        67},
    {"bertox",      53},
    {"bristle",      9},
    {"cazic",       49},
    {"drinal",      40},
    {"erollisi",    48},
    {"firiona",     77},
    {"luclin",      76},
    {"povar",        5},
    {"rathe",       46},
    {"tunare",      57},
    {"xegony",      51},
    {"zek",         54},
    {"test",         1},
    {0, 0},
};*/
#pragma pack(push)
#pragma pack(8)
#if defined(ROF2EMU) || defined(UFEMU)
typedef struct _DateStruct
{
/*0x10*/ CHAR	Hours;
/*0x11*/ CHAR	Minutes;
/*0x12*/ CHAR	Seconds;
/*0x13*/ CHAR	Month;
/*0x14*/ CHAR	Day;
/*0x16*/ WORD	Year;//for sure at 0x16 see 10022F80 in rof2 eqmain.dll -eqmule
/*0x18*/ PCXSTR	Unknown0x18;
/*0x1c*/ PCXSTR	Unknown0x1c;
/*0x20*/ PCXSTR	Unknown0x20;
/*0x28*/ __int64	TimeStamp;
/*0x30*/
}DateStruct,*PDateStruct;
#else
typedef struct _DateStruct
{
/*0x18*/ CHAR	Hours;
/*0x19*/ CHAR	Minutes;
/*0x1a*/ CHAR	Seconds;
/*0x1b*/ CHAR	Month;
/*0x1c*/ CHAR	Day;
/*0x1e*/ WORD	Year;//for sure at 0x1e see 100226D0 in eqmain.dll Jun 21 2019 -eqmule
/*0x20*/ PCXSTR	Unknown0x20;
/*0x24*/ PCXSTR	Unknown0x24;
/*0x28*/ PCXSTR	Unknown0x28;
/*0x30*/ __int64	TimeStamp;
}DateStruct,*PDateStruct;
#endif
#if defined(ROF2EMU) || defined(UFEMU)
//size is 0x48 see 10022F48 in rof2 -eqmule
typedef struct _SERVERINFO//EQClientServerData
{
/*0x00*/	DWORD ID;
/*0x04*/	PCXSTR ServerName;
/*0x08*/	PCXSTR HostName;
/*0x0C*/	PCXSTR ServerIP;
//*0x0c*/	DWORD ExternalPort;//doesn't exist in rof2 client
//*0x10*/	DWORD InternalPort;//doesn't exist in rof2 client
/*0x10*/	DateStruct DateCreated;
/*0x30*/	DWORD Flags;
/*0x34*/	DWORD ServerType;
/*0x38*/	PCXSTR LanguageCode;//at 0x38 for sure in ROF2
/*0x3C*/	PCXSTR CountryCode;
/*0x40*/	DWORD StatusFlags;
/*0x44*/	DWORD PopulationRanking;
/*0x48*/
}SERVERINFO,*PSERVERINFO;
#else
typedef struct _SERVERINFO//EQClientServerData
{
/*0x00*/	DWORD ID;
/*0x04*/	PCXSTR ServerName;
/*0x08*/	PCXSTR HostName;
/*0x0C*/	PCXSTR ServerIP;
/*0x10*/	DWORD ExternalPort;
/*0x14*/	DWORD InternalPort;
/*0x18*/	DateStruct DateCreated;
/*0x38*/	DWORD Flags;
/*0x3C*/	DWORD ServerType;
/*0x40*/	PCXSTR LanguageCode;//at 0x40 for sure
/*0x44*/	PCXSTR CountryCode;
/*0x48*/	DWORD StatusFlags;
/*0x4C*/	DWORD PopulationRanking;
/*0x50*/
}SERVERINFO,*PSERVERINFO;
#endif
typedef struct _SERVERLIST
{
/*0x00*/	PSERVERINFO Info;
/*0x04*/	_SERVERLIST *Prev;
/*0x08*/	_SERVERLIST *Next;
/*0x0C*/	DWORD Unknown0x0C;
/*0x10*/	DWORD Unknown0x10;
/*0x14*/	DWORD Unknown0x14;
/*0x18*/
}SERVERLIST,*PSERVERLIST;
#pragma pack(pop)

typedef struct _PSERVERSTUFF
{
/*0x000*/	BYTE Unknown0x000[0x8];
/*0x008*/	PVOID GFXENGINE;
/*0x00C*/	BYTE Unknown0x00C[0x9C];
/*0x0A8*/	DWORD CurrentServerID;
/*0x0AC*/	DWORD Unknown0x0AC;
/*0x0B0*/	PCXSTR LoginName;
/*0x0B4*/	PCXSTR Password;
/*0x0B8*/	PCXSTR LoginNameCopy;
/*0x0BC*/	PCXSTR PasswordCopy;
/*0x0C0*/	PCXSTR AccountKey;
/*0x0C4*/	BYTE Unknown0x0C4[0x14];
/*0x0D8*/	PSERVERINFO *FirstServer;//D8
/*0x0DC*/	PSERVERINFO *LastServer;//DC
/*0x0E0*/	BYTE Unknown0x0E0[0x8];
/*0x0E8*/	PSERVERLIST pServerList;
/*0x0EC*/	DWORD ServerListSize;
/*0x0F0*/	BYTE Unknown0x0F0[0x8];
/*0x0F8*/	DWORD QuickConnectServerID;
/*0x0FC*/	PCXSTR QuickConnectServerName;
/*0x100*/	PCXSTR QuickConnectIPAddress;//0x100
/*0x104*/
} SERVERSTUFF, *PSERVERSTUFF;
DWORD dwServerInfo = 0;
CSidlManager *pSidlManager = 0;
PCXWNDMGR pWindowManager = 0;
class CLoginViewManager *pLoginViewManager = 0;
DWORD dwEQMainBase = 0;
DWORD dwGetXMLDataAddr = 0;
DWORD dwSendLMouseClickAddr = 0;
DWORD dwEnterGameAddr = 0;
DWORD dwLoginClient = 0;
DWORD dwServerID = 0;
UINT bKickActiveChar = 1;
UINT bUseMQ2Login = false;
UINT bUseStationNamesInsteadOfSessions = false;
UINT bReLoggin = false;
bool bEndAfterCharSelect = false;
bool bLogin = true;
bool bEnd = false;
bool bInGame = false;
bool bSwitchServer = false;
bool bSwitchChar = false;
bool bSwitchTime = false;
bool bInjectorUpdate = false;
char szProfile[128] = { 0 };
char szStationName[64] = { 0 };
char szCustomIni[64] = { 0 };
char szPassword[64] = { 0 };
char szHotkey[64] = { 0 };
char szServerName[32] = { 0 };
char szCharacterName[64] = { 0 };
char szCharClass[64] = { 0 };
char szCharLevel[64] = { 0 };
