/*
 * MacroQuest2: The extension platform for EverQuest
 * Copyright (C) 2002-2019 MacroQuest Authors
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License, version 2, as published by
 * the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#pragma once

#include "Allocator.h"
#include "DynamicArray.h"

#include <algorithm>
#include <atomic>
#include <cstdint>
#include <initializer_list>
#include <string>
#include <string_view>
#include <type_traits>
#include <stdexcept>

namespace eqlib {

// initialize/shutdown the eqlib::CXStr components
void InitializeCXStr();
void ShutdownCXStr();

// This enum represents the encodings supported by CXStr. Strings can internally
// be represented as either an array of wchar_t or char, corresponding with
// "unicode" (utf16) or utf8. We primarily use utf8 here, but we need to have
// very basic support for the utf16 encoding in case we encounter a string that
// is already encoded with that encoding.
enum EStringEncoding
{
	StringEncodingUtf8,
	StringEncodingUtf16,
};

// Method of performing a string comparison
enum ECompareMode
{
	CaseSensitive,
	CaseInsensitive,
};

using Unicode16 = wchar_t;

class CXFreeList;

// This "represents" the string. This holds a reference count, and the
// allocated string itself. CXStr is a value-type wrapper that holds a
// reference to this. In then handle-body idiom, this is the body.
// See: http://www.cs.sjsu.edu/faculty/pearce/patterns/hanbod/hanbod.html
struct [[offsetcomments]] CStrRep
{
	// this isn't a std::atomic in eq, but it should have the
	// same layout in memory and thus we should be able to
	// get the same behavior from it without additional work.
/*0x00*/ std::atomic<int> refCount;
/*0x04*/ size_t alloc;
/*0x08*/ size_t length;
/*0x0c*/ EStringEncoding encoding;
/*0x10*/ CXFreeList* freeList;
	// The actual string data. Size does not matter, the length
	// is dynamic and manually allocated.
	union
	{
	/*0x14*/ char utf8[4];
	/*0x14*/ Unicode16 unicode[2];
	/*0x14*/ CStrRep* next;
	};
/*0x18*/
};

// Simple iterator traits checks
template <typename Iter>
using iter_cat_t = typename std::iterator_traits<Iter>::iterator_category;

template <typename T, class = void>
inline constexpr bool is_iterator_v = false;

template <typename T>
inline constexpr bool is_iterator_v<T, std::void_t<iter_cat_t<T>>> = true;

template <typename T>
struct is_iterator : std::bool_constant<is_iterator_v<T>> {};

// In the handle-body idiom, this is the handle. It is a value
// semantics type that holds the reference-counted CStrRep pointer.
// This class also implements copy-on-write.

// We implement lots of bonus methods on this that are not part of the EQ
// implementation, to give the string more of a std::string interface.
class EQLIB_OBJECT CXStr
{
public:
	// Types to give CXStr the qualities of a std::string
	using traits_type = std::char_traits<char>;
	using value_type = char;
	using allocator_type = eqlib::everquest_allocator<char>;
